Tekla.Structures.VariablesHelper
TeklaStructuresVariables implementation.

Tekla.Structures.VariablesHelper.cachedVariables
The cached variables.

Tekla.Structures.VariablesHelper.Add(System.String)
Adds a variable of given key to the list.
key: The variable to be added.

Tekla.Structures.VariablesHelper.Get(System.String)
Gets a value for given key.
key: The key to get.
Returns:
The value for given key, or empty if not present.

Tekla.Structures.VariablesHelper.ContainsVariable(System.String)
Determines whether the specified key contains variable.
key: The key.
Returns:
true if the specified key contains variable; otherwise, false.